let arr = {
    Мамонт : "Человек, подвёргшийся обману",
    Траффер : "Человек, приводящий мамонтов на стиллер",
    Холд : "Временное удержание средств в целях сохранности сделки",
    Гарант : "Человек, имеющий репутацию на форуме, помогающий провести безопасную сделку между двумя лицами (продавцом и покупателем)",
    Арбитраж : "Жалоба на человека",
    Ланской : "Главный админ лолзтима",
    Лолз : " Сокращенное название форума LolzTeam",
    Симпатия : "Показатель репутации на форуме",
    Фишинг : "Хищение виртуального имущества (аккаунтов, предметов и т.д.) путем создания копии веб страницы",
    Стиллер : "Вредоносное программное обеспечение, используемое для хищения паролей",
    Стилер : "Вредоносное программное обеспечение, используемое для хищения паролей",
    Скам : "Обман в интренете",
    Крипт : "Способ скрытия вредоносного ПО в целях незаметного для антивирусных программ запуска его на компьютере мамонта",
    Рефанд : "Возврат средств за покупку",
    Рефаунд : "Возврат средств за покупку",
    Акк : "Аккаунт, учетная запись (на ВК, тытрубе и т. д.)",
    Бан : "Блокировка пользователя в игре/чятике/форуме/и т. д.",
    Баг : "Ошибка в программе",
    Фича : "Дополнительная возможность/функциональность программы или девайса",
    Новокек : "Недавно зарегестрировавшийся на форуме пользователь, не имеющий репутации",
    Лог : " файлы, как правило содержащие системную информацию сервера/компьютера. В большинстве случаев логами называют файлы, собранные мошенническим способом с компьютером жертвы (запуск стиллера на компьютере жертвы)",
    Автоучастие : "Автоматическое участие во всех денежных розыграшах lolz.guru",
    Кардинг : "Кража, продажа, обнал карт.",
    Обнал : "обналичивание денежных средств с грязных счетов.",
    Абуз : "получение чего либо от какой-то акции какого либо сайта/бота и прочего",
    Тс : "создатель темы",
    Воркер : "работник в той или иной сфере",
    Капча : " компьютерный тест, используемый для того, чтобы определить, кем является пользователь системы: человеком или компьютером.",
    Скуп : "человек, покупающий у людей что-то для перепродажи или обработки в своих целях.",
    Тз : "Техничесоке задание - документ или несколько документов, определяющих цель, структуру, свойства и методы какого-либо проекта, и исключающие двусмысленное толкование различными исполнителями.",
    Тп : "техническая поддержка чего либо.",
    Кодер : "пишет код для ботов, сайтов и так далее.",
    Уник : "Уникальная расцветка никнейма юзера",
    Lzttranslate : "переводчик форумного сленга, который дает понятное объяснение терминов форума",
    Мануал : "это руководство пользователя или грубо говоря - инструкция.",
    Валид : "рабочие аккаунт или программа. ",
    Невалид : "нерабочие аккаунт или программа.",
    Авторег : "автоматически зарегистрированные аккаунт, то-есть страница, созданная путем массовой регистрации.",
    Оффтоп : "любое сообщение, содержание которого не относится к заранее указанной теме общения; нарушение правил форума LZT.",
    Вериф : "проверка, подтверждение алгоритмов, программ и процедур путём их сопоставления с данными, алгоритмами и программами. Методика распознавания на соответствие правде.",
    Билд : "готовая версия программы, может быть билд стиллера, а может майнера. Грубо говоря - это ехе файл.",
    Криптостример : "Человек ведет трансляцию, суть в том, что, если мамонт отправит криптовалюту на указанный адрес, он якобы получит вдвое больше",
    Куратор : " Пользователь состоящий в команде форума, курирует различные разделы форума" ,
    Арбитр : "Пользователь состоящий в команде форума, решает арбитражи на форуме",
    Мфо : "микро финансовая организация",
    Кардер : " человек покупающий что либо с чужих кредитных карт ",
    Деанон : "полное раскрытие личности пользователя",
    Авитоскамер : "человек занимающийся скамом на доске объявлений Авито",
    Дизайнер : "человек занимающийся в сфере дизайна",
    Дроп : "человек через которого проводят черные схемы",
    Меценат : "пользователь пожертвовавший форуму крупную сумму денег" ,
    Брут : "аккаунт, к которому был подобран пароль.",
    Зп : "заработная плата воркера (рабочего)",
    База : "база аккаунтов для брута состоящая в основном почты:пароля",
    Га : "главный админ",
    Прокси : " это удаленный компьютер-посредник, с помощью которого можно подключиться к интернету как будто из другой страны, с другим ip адресом",
    Дедик : "удалённый компьютер (сервер)",
    Линк : "ссылка",
    cc : " кредитная карта или любая платежная карта",
    сс : " кредитная карта или любая платежная карта",
    Сс : " кредитная карта или любая платежная карта",
    Холодок : "Холодный кошелек. Это аппаратное устройство для хранения биткойнов или другой криптовалюты в автономном режиме",
    Парсер : "программа которая сканирует данные поступившие на вход и вычленяет из них некоторые элементы.",
    Чекер : "программа для проверки на валид аккаунта, промокода и т.д. и т.п.",
    Граббер : "программа, которая собирает информацию со сторонних ресурсов.",
    Платега : "платежная система. система через которую происходят платежи. Пример freekassa, enot pay",
    Платежка : "платежная система. система через которую происходят платежи. Пример freekassa, enot pay",
    Ручник : "человек вручную обрабатывающий ворованные данные карты через платежную систему",
    Скрипт : "это последовательность действий, описанных с помощью скриптового языка программирования (JavaScript, PHP, Perl, Python и др.)",
    Клиппер : "Вредоносная программа подменяющая адреса платежей на ПК жертвы",
    Майнер : "Вредоносная программа добывающая криптовалюту на чужем ПК",
    Редлайн : "один из самых популярных стиллеров на данный момент",
    Питонист : " Человек пишущий код на языке программирования  Python",
    Крипта : "средство платежа, которое существует только в интернете",
    'Redactor.js': "wysiwyg редактор от компании imperavi, использующийся на форуме и имеющий кучу багов"


}
console.log(Object.keys(arr))
let input = document.getElementById('input');
let output = document.getElementById('output');
function getThis(){
    console.log(input.value);
    let inputVal = input.value;
    inputVal = inputVal.trim();
    let UpQue = inputVal[0].toUpperCase() + inputVal.slice(1);
    if(UpQue in arr == true){
        output.style.color = '#228f5d';
        output.innerHTML = arr[UpQue];
    }else{
        output.style.color = '#e33030';
        output.innerHTML = "Определение не найдено";
    }  
}
 
